# Set2DCompLocation

```pascal
FUNCTION Set2DCompLocation(
				hObject      : HANDLE;
				component    : INTEGER;
				onBoundsCube : BOOLEAN;
				offset       : REAL): BOOLEAN;
```

```python
def vs.Set2DCompLocation(hObject, component, onBoundsCube, offset):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|   |
|component|INTEGER|   |
|onBoundsCube|BOOLEAN|   |
|offset|REAL|   |

## Version
Availability: from Vectorworks 2020

## Category
* Objects - Custom